{"keras_version": "1.2.1", "config": [{"config": {"activity_regularizer": null, "output_dim": 128, "trainable": true, "input_dim": 120000, "input_dtype": "int32", "batch_input_shape": [null, null], "mask_zero": false, "init": "uniform", "dropout": 0.2, "input_length": null, "W_regularizer": null, "name": "embedding_1", "W_constraint": null}, "class_name": "Embedding"}, {"config": {"unroll": false, "name": "lstm_1", "W_regularizer": null, "trainable": true, "input_dim": 128, "stateful": false, "U_regularizer": null, "dropout_W": 0.2, "return_sequences": false, "init": "glorot_uniform", "activation": "tanh", "input_length": null, "output_dim": 128, "go_backwards": false, "b_regularizer": null, "inner_init": "orthogonal", "dropout_U": 0.2, "consume_less": "cpu", "forget_bias_init": "one", "inner_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "activity_regularizer": null, "bias": true, "W_regularizer": null, "trainable": true, "input_dim": 128, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "output_dim": 7, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}
